{"config":{"indexing":"full","lang":["en"],"min_search_length":3,"prebuild_index":false,"separator":"[\\s\\-]+"},"docs":[{"location":"","text":"Welcome to Rigel Project Information Navigation Please use tabs placed at the top for navigation. Search It is possible to use search, see the Search field in the top right corner.","title":"Home"},{"location":"#welcome-to-rigel-project-information","text":"","title":"Welcome to Rigel Project Information"},{"location":"#navigation","text":"Please use tabs placed at the top for navigation.","title":"Navigation"},{"location":"#search","text":"It is possible to use search, see the Search field in the top right corner.","title":"Search"},{"location":"administrative/collaboration/cde/","text":"Collaborative development environment Any project benefits greatly from a Collaborative development environment (CDE) . Rigel Project is not an exception and also may benefit from a CDE. CDE use-cases are: source control; issues tracking; WiKi / documentation; project management (?); CI/CD (?) team members discussion / chat; information flow in the team Cloud-based vs self-hosted The are 2 possibilities to store (host) a CDE: in the cloud (GutHub, GitLab, Bitbucket/Jira, Azure DevOps) This type is suitable for organisations that may store Intellectual Property (IP) in the cloud. Self-hosted (GitLab hosted, Gitea, Gogs) This type fits organisations that either cannot store IP in the cloud or want stricter control over the information. In my opinion, Rigel Project IP may be hosted entirely in the cloud (unless forced for self-hosting by external factors). It is important to emphasize though, that the entire Rigel Project IP is private, not public. Cloud-based options GitHub GitHub was a flagship of open-source development since 2008. Any open-source project almost automatically had a repository on GitHub. GitHub's popularity in 201x was like IBM's in 196x. Over time GitHub added project management functionality and private projects support. Since 2018 GitHub belongs to The Evil Company which is a drawback :( Anyway, even today GitHub is the most used platform for open-source development and de facto standard for functionality. Pricing : $4 per month / per user GitHub Free ($0 per month / per user) is a bit limited (no WiKi and GitHub Pages for private repos). Project Management capabilities GitHub has the following built-in Project management features: Project Boards (Kanban); Issues; Labels; Milestones In fact, GitHub invests a lot of effort in order to improve Project Management features and make the platform more attractive for organizations that may consider Jira instead. Also thanks to countless GitHub integrations, there is a lot of additional functionality. For example, it is possible to generate free Gantt charts on the fly directly from GitHub issues. To the best of my understanding, such Gannt charts do not require any manual maintenance . Jira/Bitbucket Enterprise-oriented software by Atlassian. Started as a complex and very feature-rich management software - Jira. Allows graphs, Gantt charts, Agile and makes managers happy. Jira is loved by management and disliked by developers. Atlassian added Bitbucket for source control and Confluence for collaboration. Then they added Trello for Kanban boards. Two of my client companies use Jira/Bitbucket/Confluence combination. Jira definitely gives more management features over GitHub but I doubt they are relevant for the Rigel Project. Frankly speaking, I do not even understand the pricing! :) GitLab Started as a GitHub clone. Today it is similar to GitHub in feature set. GitLab is perceived as a more dynamic and lean company (which is easy compared to Microsoft). GitLab provides open-source GitLab CE revision for self-hosting. Personal experience for my open-source project: all is well. But I use only source control. Pricing : $19 per month / per user 5 (five) times more expensive than GitHub :( Meh. Azure DevOps Looks like a descent DevOps platform (I have a small experience with it). It seems though that it is more oriented towards Microsoft products and Azure Web Services. A comprehensive comparison Azure DevOps vs GitHub Pricing : First 5 users free, then $6 per month / per user Opinion: GitHub Combination of: being a market leader for open-source development; good support of private projects; descent project management capabilities (in my opinion); numerous third-party integrations; GitHub Pages for static sites (like this one); huge list of government agencies which implies GitHub reliability; very strong (though evil) parent company; modest price","title":"Collaborative Development Environment"},{"location":"administrative/collaboration/cde/#collaborative-development-environment","text":"Any project benefits greatly from a Collaborative development environment (CDE) . Rigel Project is not an exception and also may benefit from a CDE. CDE use-cases are: source control; issues tracking; WiKi / documentation; project management (?); CI/CD (?) team members discussion / chat; information flow in the team","title":"Collaborative development environment"},{"location":"administrative/collaboration/cde/#cloud-based-vs-self-hosted","text":"The are 2 possibilities to store (host) a CDE: in the cloud (GutHub, GitLab, Bitbucket/Jira, Azure DevOps) This type is suitable for organisations that may store Intellectual Property (IP) in the cloud. Self-hosted (GitLab hosted, Gitea, Gogs) This type fits organisations that either cannot store IP in the cloud or want stricter control over the information. In my opinion, Rigel Project IP may be hosted entirely in the cloud (unless forced for self-hosting by external factors). It is important to emphasize though, that the entire Rigel Project IP is private, not public.","title":"Cloud-based vs self-hosted"},{"location":"administrative/collaboration/cde/#cloud-based-options","text":"","title":"Cloud-based options"},{"location":"administrative/collaboration/cde/#github","text":"GitHub was a flagship of open-source development since 2008. Any open-source project almost automatically had a repository on GitHub. GitHub's popularity in 201x was like IBM's in 196x. Over time GitHub added project management functionality and private projects support. Since 2018 GitHub belongs to The Evil Company which is a drawback :( Anyway, even today GitHub is the most used platform for open-source development and de facto standard for functionality. Pricing : $4 per month / per user GitHub Free ($0 per month / per user) is a bit limited (no WiKi and GitHub Pages for private repos).","title":"GitHub"},{"location":"administrative/collaboration/cde/#project-management-capabilities","text":"GitHub has the following built-in Project management features: Project Boards (Kanban); Issues; Labels; Milestones In fact, GitHub invests a lot of effort in order to improve Project Management features and make the platform more attractive for organizations that may consider Jira instead. Also thanks to countless GitHub integrations, there is a lot of additional functionality. For example, it is possible to generate free Gantt charts on the fly directly from GitHub issues. To the best of my understanding, such Gannt charts do not require any manual maintenance .","title":"Project Management capabilities"},{"location":"administrative/collaboration/cde/#jirabitbucket","text":"Enterprise-oriented software by Atlassian. Started as a complex and very feature-rich management software - Jira. Allows graphs, Gantt charts, Agile and makes managers happy. Jira is loved by management and disliked by developers. Atlassian added Bitbucket for source control and Confluence for collaboration. Then they added Trello for Kanban boards. Two of my client companies use Jira/Bitbucket/Confluence combination. Jira definitely gives more management features over GitHub but I doubt they are relevant for the Rigel Project. Frankly speaking, I do not even understand the pricing! :)","title":"Jira/Bitbucket"},{"location":"administrative/collaboration/cde/#gitlab","text":"Started as a GitHub clone. Today it is similar to GitHub in feature set. GitLab is perceived as a more dynamic and lean company (which is easy compared to Microsoft). GitLab provides open-source GitLab CE revision for self-hosting. Personal experience for my open-source project: all is well. But I use only source control. Pricing : $19 per month / per user 5 (five) times more expensive than GitHub :( Meh.","title":"GitLab"},{"location":"administrative/collaboration/cde/#azure-devops","text":"Looks like a descent DevOps platform (I have a small experience with it). It seems though that it is more oriented towards Microsoft products and Azure Web Services. A comprehensive comparison Azure DevOps vs GitHub Pricing : First 5 users free, then $6 per month / per user","title":"Azure DevOps"},{"location":"administrative/collaboration/cde/#opinion-github","text":"Combination of: being a market leader for open-source development; good support of private projects; descent project management capabilities (in my opinion); numerous third-party integrations; GitHub Pages for static sites (like this one); huge list of government agencies which implies GitHub reliability; very strong (though evil) parent company; modest price","title":"Opinion: GitHub"},{"location":"administrative/hardware/boards-options/","text":"ACU Boards Options Microprocessors-based (with MMU ) Microprocessors have MMU , have powerful, often multicore CPUs and large multi-megabyte RAM. Such features make microprocessors ideal platforms to run Linux OS. In fact, MMU is the cornerstone of all feature-rich OSes like Linux or macOS. Another very important resource is RAM: Linux is unable to run in anything smaller than 8(?) MB of RAM. (Though the last time I personally ran Linux in 8MB RAM was in 2001.) Non-Chinese origin constraint Inability to use neither a Chinese processor / SoC nor a Chinese board is a serious limitation, since a large number of low-cost boards are currently designed and manufactured in China. MMU -equipped boards options Table of MMU -equipped interesting boards. Board Manufacturer Country Price (10K volume) Availability STMP157-OLinuXino-LIME2 Olimex Bulgaria 41.40 / 43.20 EUR Immediate ODROID-C4 Hardkernel Korea 51.30 USD End of August, 2022 BeagleBone Green SeeedStudio Complicated 49.50 USD Immediate BeagleBone Green origin While SeeedStudio is a Chinese company it does not means that BeagleBone Green is a Chinese product. BeagleBone Green is a simplified version of BeagleBone Black . BeagleBone Black, in turn, is an open-hardware initiative of Texas Instruments which is a major US military designer. BeagleBone Black uses TI Sitara AM335x SoC and is certified as an Open Source Hardware design . Thus anyone may take BeagleBone Black and do whatever it want with it. So SeeedStudio took it and produced simplified (and cheaper) BeagleBone Green . Microcontrollers-based (without MMU ) Microcontrollers do not have MMU , have weaker CPU (generally single-core) and much smaller RAM (hundreds of kBs). Thus generally it is impossible to run Linux on a microcontroller. Interestingly enough, several high-end evaluation boards of the STM32 microcontrollers family are equipped with external SRAM and are supported by the mainline Linux kernel. It means that it is possible to run Linux on such boards (at least in theory). Warning Important to note that all STM32 boards mentioned below are evaluation boards (kits) provided by STMicro . Generally evaluation boards are not available in large quantities and thus are not good for productions. MMU -less boards options Table of MMU -less viable boards. Board Manufacturer Country Price (1 unit) Availability STM32F746G-DISCO STMicro France/Italy 54 / 56 USD Immediate(?) 32F429IDISCOVERY STMicro France/Italy 29.90 USD Immediate(?) Warning Attractive price of 32F429IDISCOVERY comes with a cost of a weakish CPU. Opinion: STMP157-OLinuXino-LIME2 STMP157-OLinuXino-LIME2 has several strong points over other boards. Let's discuss them below. Processor / SoC STMP157-OLinuXino-LIME2 is based on a new STM32MP157 processor specifically designed for Linux and a real-time activity. This processor has dual core Cortex A7@800MHz for Linux and additional rather powerful Cortex M4@209MHz for a real-time tasks. According to the Cores Performance , Cortex M4@209MHz produces 209 MHz * 1.25 DMIPS / MHz = 261.25 DMIPS which seems like a descent raw power for real-time tasks . On the other hand, dual Cortex A7@800MHz according to the same Cores Performance produces 2 * 800 MHz * 1.9 DMIPS / MHz = 3040 DMIPS which seems like more than enough for the intended Linux activities. For comparison, Orbit's solution based on Quad core Cortex A9@800MHz gives 4 * 800 MHz * 2.5 DMIPS / MHz = 8000 DMIPS As the entire Orbit solution takes ~8% of the CPU for all tasks (Linux control plane + real-time over Linux) which means 8000 DMIPS * 0.08 = 640 DMIPS it seems like STM32MP157 is a good fit. Note Though the STM32MP157 is a new processor, it greatly benefits from being a part of a hugely successful STM32 microprocessors family. Board origin Olimex is a highly valued company which exists since 1991 and produces high-quality boards with good support. Price Frankly speaking, I was surprised to find an industrial non-chinese board with a SoC from a major manufacturer under $50 for 10K quantities.","title":"Boards Options"},{"location":"administrative/hardware/boards-options/#acu-boards-options","text":"","title":"ACU Boards Options"},{"location":"administrative/hardware/boards-options/#microprocessors-based-with-mmu","text":"Microprocessors have MMU , have powerful, often multicore CPUs and large multi-megabyte RAM. Such features make microprocessors ideal platforms to run Linux OS. In fact, MMU is the cornerstone of all feature-rich OSes like Linux or macOS. Another very important resource is RAM: Linux is unable to run in anything smaller than 8(?) MB of RAM. (Though the last time I personally ran Linux in 8MB RAM was in 2001.)","title":"Microprocessors-based (with MMU)"},{"location":"administrative/hardware/boards-options/#non-chinese-origin-constraint","text":"Inability to use neither a Chinese processor / SoC nor a Chinese board is a serious limitation, since a large number of low-cost boards are currently designed and manufactured in China.","title":"Non-Chinese origin constraint"},{"location":"administrative/hardware/boards-options/#mmu-equipped-boards-options","text":"Table of MMU -equipped interesting boards. Board Manufacturer Country Price (10K volume) Availability STMP157-OLinuXino-LIME2 Olimex Bulgaria 41.40 / 43.20 EUR Immediate ODROID-C4 Hardkernel Korea 51.30 USD End of August, 2022 BeagleBone Green SeeedStudio Complicated 49.50 USD Immediate","title":"MMU-equipped boards options"},{"location":"administrative/hardware/boards-options/#beaglebone-green-origin","text":"While SeeedStudio is a Chinese company it does not means that BeagleBone Green is a Chinese product. BeagleBone Green is a simplified version of BeagleBone Black . BeagleBone Black, in turn, is an open-hardware initiative of Texas Instruments which is a major US military designer. BeagleBone Black uses TI Sitara AM335x SoC and is certified as an Open Source Hardware design . Thus anyone may take BeagleBone Black and do whatever it want with it. So SeeedStudio took it and produced simplified (and cheaper) BeagleBone Green .","title":"BeagleBone Green origin"},{"location":"administrative/hardware/boards-options/#microcontrollers-based-without-mmu","text":"Microcontrollers do not have MMU , have weaker CPU (generally single-core) and much smaller RAM (hundreds of kBs). Thus generally it is impossible to run Linux on a microcontroller. Interestingly enough, several high-end evaluation boards of the STM32 microcontrollers family are equipped with external SRAM and are supported by the mainline Linux kernel. It means that it is possible to run Linux on such boards (at least in theory). Warning Important to note that all STM32 boards mentioned below are evaluation boards (kits) provided by STMicro . Generally evaluation boards are not available in large quantities and thus are not good for productions.","title":"Microcontrollers-based (without MMU)"},{"location":"administrative/hardware/boards-options/#mmu-less-boards-options","text":"Table of MMU -less viable boards. Board Manufacturer Country Price (1 unit) Availability STM32F746G-DISCO STMicro France/Italy 54 / 56 USD Immediate(?) 32F429IDISCOVERY STMicro France/Italy 29.90 USD Immediate(?) Warning Attractive price of 32F429IDISCOVERY comes with a cost of a weakish CPU.","title":"MMU-less boards options"},{"location":"administrative/hardware/boards-options/#opinion-stmp157-olinuxino-lime2","text":"STMP157-OLinuXino-LIME2 has several strong points over other boards. Let's discuss them below.","title":"Opinion: STMP157-OLinuXino-LIME2"},{"location":"administrative/hardware/boards-options/#processor-soc","text":"STMP157-OLinuXino-LIME2 is based on a new STM32MP157 processor specifically designed for Linux and a real-time activity. This processor has dual core Cortex A7@800MHz for Linux and additional rather powerful Cortex M4@209MHz for a real-time tasks. According to the Cores Performance , Cortex M4@209MHz produces 209 MHz * 1.25 DMIPS / MHz = 261.25 DMIPS which seems like a descent raw power for real-time tasks . On the other hand, dual Cortex A7@800MHz according to the same Cores Performance produces 2 * 800 MHz * 1.9 DMIPS / MHz = 3040 DMIPS which seems like more than enough for the intended Linux activities. For comparison, Orbit's solution based on Quad core Cortex A9@800MHz gives 4 * 800 MHz * 2.5 DMIPS / MHz = 8000 DMIPS As the entire Orbit solution takes ~8% of the CPU for all tasks (Linux control plane + real-time over Linux) which means 8000 DMIPS * 0.08 = 640 DMIPS it seems like STM32MP157 is a good fit. Note Though the STM32MP157 is a new processor, it greatly benefits from being a part of a hugely successful STM32 microprocessors family.","title":"Processor / SoC"},{"location":"administrative/hardware/boards-options/#board-origin","text":"Olimex is a highly valued company which exists since 1991 and produces high-quality boards with good support.","title":"Board origin"},{"location":"administrative/hardware/boards-options/#price","text":"Frankly speaking, I was surprised to find an industrial non-chinese board with a SoC from a major manufacturer under $50 for 10K quantities.","title":"Price"},{"location":"administrative/hardware/cores-performance/","text":"Cores Performance An important parameter of a core performance is DMIPS / MHz. The higher the number, the more powerful the core. Comparison of various ARM cores Core DMIPS / MHz Cortex A9 2.5 Cortex A8 2.0 Cortex A7 1.9 Cortex M4 1.25","title":"Cores Performance"},{"location":"administrative/hardware/cores-performance/#cores-performance","text":"An important parameter of a core performance is DMIPS / MHz. The higher the number, the more powerful the core.","title":"Cores Performance"},{"location":"administrative/hardware/cores-performance/#comparison-of-various-arm-cores","text":"Core DMIPS / MHz Cortex A9 2.5 Cortex A8 2.0 Cortex A7 1.9 Cortex M4 1.25","title":"Comparison of various ARM cores"},{"location":"reqs-n-specs/","text":"Requirements and Specifications","title":"Reqs&Specs"},{"location":"reqs-n-specs/#requirements-and-specifications","text":"","title":"Requirements and Specifications"}]}